app/Controllers/Books.php

INSERT INTO `books` (`sampul`, `judul`, `slug`, `penulis`, `penerbit`, `harga`, `deskripsi`, `stok`, `created_at`, `updated_at`) VALUES ('1702911130_a2ab50445fa23d8deb54.jpeg', 'test', 'test', 'test', 'test', '166666', 'test', '12', '2023-12-18 14:52:10', '2023-12-18 14:52:10')
---
    public function save()
    {
        $slug = url_title($this->request->getVar('judul'), '-', true);
        //handle save file too
        $fileSampul = $this->request->getFile('sampul');
        //cek apakah ada gambar yang diupload
        $namaSampul = 'default.jpeg';
        if ($fileSampul->getError() == 4) {
            $namaSampul = 'default.jpeg';
        } else {
            //generate nama sampul random
            $namaSampul = $fileSampul->getRandomName();
            //pindahkan file ke folder img
            $fileSampul->move('img', $namaSampul);
            $namaSampul = $fileSampul->getName();
        }

        //ambil nama file

        $this->bookModel->save([
            'sampul' => $namaSampul,
            'judul' => $this->request->getVar('judul'),
            'slug' => $slug,
            'penulis' => $this->request->getVar('penulis'),
            'penerbit' => $this->request->getVar('penerbit'),
            'deskripsi' => $this->request->getVar('deskripsi'),
            'stok' => $this->request->getVar('stok'),
            'created_at' => date('Y-m-d H:i:s'),
            'updated_at' => date('Y-m-d H:i:s')
        ]);

UPDATE `books` SET `sampul` = '1702962328_4f35a9065daab557cdbb.jpeg', `judul` = 'Harry Potter', `slug` = 'harry-potter', `penulis` = 'JK Rowling', `penerbit` = 'Kompas', `harga` = '90000', `deskripsi` = 'Ini adalah buku Harry Potter the Philosopher Stone', `stok` = '15'
WHERE `books`.`id` IN ('14')
---
    public function update($id)
    {
        $bookLama = $this->bookModel->getBook($id);
        $slug = url_title($this->request->getVar('judul'), '-', true);
        //cek jika gambar tidak diubah
        $fileSampul = $this->request->getFile('sampul');
        $namaSampul = $bookLama['sampul'];
        if ($fileSampul->getError() == 4) {
            $namaSampul = $bookLama['sampul'];
        } else {
            //generate nama file random
            $namaSampul = $fileSampul->getRandomName();
            //pindahkan gambar
            $fileSampul->move('img', $namaSampul);
            //hapus file lama
            unlink('img/' . $this->request->getVar('current_sampul'));
        }

        $this->bookModel->save([
            'id' => $id,
            'sampul' => $namaSampul,
            'judul' => $this->request->getVar('judul'),
            'slug' => $slug,
            'penulis' => $this->request->getVar('penulis'),
            'penerbit' => $this->request->getVar('penerbit'),
            'deskripsi' => $this->request->getVar('deskripsi'),
            'stok' => $this->request->getVar('stok')
        ]);