app/Models/BookModel.php

    public function getBook($id = false)
    {
        if ($id == false) {
            return $this->findAll();
        }
        return $this->where(['id' => $id])->first();
---
SELECT *
FROM `books`
SELECT *
FROM `books`
WHERE `id` = '14'
 LIMIT 1