app/Models/LoginModel.php

    public function getDataUsers($username, $password)
    {
        $db = \Config\Database::connect();

        $query = $db->table('users')
            ->select('username')
            ->where('username', $username)
            ->where('password', $password)
            ->get();
---
SELECT `username`
FROM `users`
WHERE `username` = 'admin'
AND `password` = 'admin'